In [85]:
people = {'first': ['Corey','Jane','John'],
          'last' : ['Shafer','Doe','Doe'],
          'email' :['CoreyMShafer@gmail.com','JaneDoe@email.com','JohnDoe@email.com']
          }

In [2]:
people['email']

['CoreyMShafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']

In [86]:
import pandas as pd

In [87]:
df = pd.DataFrame(data=people)

In [25]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@email.com
2   John     Doe       JohnDoe@email.com

In [6]:
df.email

0    CoreyMShafer@gmail.com
1         JaneDoe@email.com
2         JohnDoe@email.com
Name: email, dtype: object

In [7]:
type(df.email)

pandas.core.series.Series

In [8]:
df[['last','email']]

     last                   email
0  Shafer  CoreyMShafer@gmail.com
1     Doe       JaneDoe@email.com
2     Doe       JohnDoe@email.com

In [9]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [10]:
# iloc integer location
df.iloc[[0,1],-1]

0    CoreyMShafer@gmail.com
1         JaneDoe@email.com
Name: email, dtype: object

In [11]:
# loc label 
df.loc[[0,1],['email','last']]

                    email    last
0  CoreyMShafer@gmail.com  Shafer
1       JaneDoe@email.com     Doe

In [12]:
df.set_index('email',inplace=True)

In [13]:
df

                        first    last
email
CoreyMShafer@gmail.com  Corey  Shafer
JaneDoe@email.com        Jane     Doe
JohnDoe@email.com        John     Doe

In [14]:
df.index

Index(['CoreyMShafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com'], dtype='object', name='email')

In [15]:
df.loc['CoreyMShafer@gmail.com','last']

'Shafer'

In [16]:
df.reset_index()

                    email  first    last
0  CoreyMShafer@gmail.com  Corey  Shafer
1       JaneDoe@email.com   Jane     Doe
2       JohnDoe@email.com   John     Doe

In [17]:
df

                        first    last
email
CoreyMShafer@gmail.com  Corey  Shafer
JaneDoe@email.com        Jane     Doe
JohnDoe@email.com        John     Doe

**Filter**

In [39]:
filt = (df['last'] == 'Shafer') | (df['first'] == 'John')

In [40]:
df[filt]

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
2   John     Doe       JohnDoe@email.com

In [41]:
# ~ help neglet the filter
df.loc[~filt,'email']

1     JaneDoe@email.com
3    Ironman@avenge.com
4        Cap@avenge.com
Name: email, dtype: object

**Modify column**

In [42]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [43]:
# rename column 
df.columns = ['first_name','last_name','email']

In [44]:
df

  first_name last_name                   email
0      Corey    Shafer  CoreyMShafer@gmail.com
1       Jane       Doe       JaneDoe@email.com
2       John       Doe       JohnDoe@email.com
3       Tony     Stark      Ironman@avenge.com
4      Steve    Rogers          Cap@avenge.com

In [45]:
# uppercase all col name
df.columns = [x.upper() for x in df.columns]

In [46]:
# change spcace with underscore
df.columns = df.columns.str.replace(' ','_')

In [47]:
# lowercase all col name
df.columns = [x.lower() for x in df.columns]

In [48]:
df

  first_name last_name                   email
0      Corey    Shafer  CoreyMShafer@gmail.com
1       Jane       Doe       JaneDoe@email.com
2       John       Doe       JohnDoe@email.com
3       Tony     Stark      Ironman@avenge.com
4      Steve    Rogers          Cap@avenge.com

In [49]:
# change some columns use rename method in dict
df.rename(columns={'first_name':'first','last_name':'last'}, inplace=True)

In [50]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@email.com
2   John     Doe       JohnDoe@email.com
3   Tony   Stark      Ironman@avenge.com
4  Steve  Rogers          Cap@avenge.com

In [51]:
# update data in single value
df.loc[2] = ['John','Smith','JohnSimth@email.com']

In [52]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@email.com
2   John   Smith     JohnSimth@email.com
3   Tony   Stark      Ironman@avenge.com
4  Steve  Rogers          Cap@avenge.com

In [53]:
# change single col of 85 row (notice don't have first col don't need to pass val for first)
df.loc[2,['last','email']] = ['Doe','JohnDoe@email.com']

In [54]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@email.com
2   John     Doe       JohnDoe@email.com
3   Tony   Stark      Ironman@avenge.com
4  Steve  Rogers          Cap@avenge.com

In [55]:
# change a single value
df.loc[2,'last'] = 'Smith'

In [56]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@email.com
2   John   Smith       JohnDoe@email.com
3   Tony   Stark      Ironman@avenge.com
4  Steve  Rogers          Cap@avenge.com

In [57]:
# change a single value
df.at[2,'last'] = 'Smith'

In [58]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@email.com
2   John   Smith       JohnDoe@email.com
3   Tony   Stark      Ironman@avenge.com
4  Steve  Rogers          Cap@avenge.com

In [59]:
# Update single row using filter
filt = (df['last']) == 'Smith'
df.loc[filt,'last'] = 'Doe'
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@email.com
2   John     Doe       JohnDoe@email.com
3   Tony   Stark      Ironman@avenge.com
4  Steve  Rogers          Cap@avenge.com

In [60]:
# update multiple row to lowercase email
df['email'] = df['email'].str.lower()
df

   first    last                   email
0  Corey  Shafer  coreymshafer@gmail.com
1   Jane     Doe       janedoe@email.com
2   John     Doe       johndoe@email.com
3   Tony   Stark      ironman@avenge.com
4  Steve  Rogers          cap@avenge.com

## Apply
use to calling a func on value (Series,DataFrame)

In [61]:
# using apply on Series (apply func on every elem in Series)
df['email'].apply(len)

0    22
1    17
2    17
3    18
4    14
Name: email, dtype: int64

In [62]:
# update multiply row by apply
def update_email(email):
    return email.upper()
df['email'].apply(update_email)

0    COREYMSHAFER@GMAIL.COM
1         JANEDOE@EMAIL.COM
2         JOHNDOE@EMAIL.COM
3        IRONMAN@AVENGE.COM
4            CAP@AVENGE.COM
Name: email, dtype: object

In [63]:
df['email'] = df['email'].apply(update_email)

In [64]:
df

   first    last                   email
0  Corey  Shafer  COREYMSHAFER@GMAIL.COM
1   Jane     Doe       JANEDOE@EMAIL.COM
2   John     Doe       JOHNDOE@EMAIL.COM
3   Tony   Stark      IRONMAN@AVENGE.COM
4  Steve  Rogers          CAP@AVENGE.COM

In [65]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [66]:
df

   first    last                   email
0  Corey  Shafer  coreymshafer@gmail.com
1   Jane     Doe       janedoe@email.com
2   John     Doe       johndoe@email.com
3   Tony   Stark      ironman@avenge.com
4  Steve  Rogers          cap@avenge.com

In [67]:
# using apply on DataFrame (apply func on each Series 3 row)
df.apply(len, axis='columns')

0    3
1    3
2    3
3    3
4    3
dtype: int64

In [68]:
df.apply(pd.Series.min)

first             Corey
last                Doe
email    cap@avenge.com
dtype: object

In [69]:
# x is Series in DataFrame
df.apply(lambda x: x.min())

first             Corey
last                Doe
email    cap@avenge.com
dtype: object

## Applymap
using to apply func on every elem in DataFrame (DataFrame only)

In [70]:
# applymap apply to every elem in DF
df.applymap(len)

   first  last  email
0      5     6     22
1      4     3     17
2      4     3     17
3      4     5     18
4      5     6     14

In [71]:
df.applymap(str.lower)

   first    last                   email
0  corey  shafer  coreymshafer@gmail.com
1   jane     doe       janedoe@email.com
2   john     doe       johndoe@email.com
3   tony   stark      ironman@avenge.com
4  steve  rogers          cap@avenge.com

## Map
only work with Series (substituing each value in Series with another value)

In [72]:
# value didn't substiue transform to NaN 
df['first'].map({'Corey':'Chris','Jane':'Mary'})

0    Chris
1     Mary
2      NaN
3      NaN
4      NaN
Name: first, dtype: object

## Replace

In [73]:
df['first'].replace({'Corey':'Chris','Jane':'Mary'})

0    Chris
1     Mary
2     John
3     Tony
4    Steve
Name: first, dtype: object

## Adding Columns

In [74]:
# combing frist + last 
df['first']+ ' '+ df['last']

0    Corey Shafer
1        Jane Doe
2        John Doe
3      Tony Stark
4    Steve Rogers
dtype: object

In [75]:
df['full_name'] = df['first']+ ' '+ df['last']

In [76]:
df

   first    last                   email     full_name
0  Corey  Shafer  coreymshafer@gmail.com  Corey Shafer
1   Jane     Doe       janedoe@email.com      Jane Doe
2   John     Doe       johndoe@email.com      John Doe
3   Tony   Stark      ironman@avenge.com    Tony Stark
4  Steve  Rogers          cap@avenge.com  Steve Rogers

## Removing Columns

In [77]:
df.drop(columns=['first','last'], inplace=True)

In [78]:
df

                    email     full_name
0  coreymshafer@gmail.com  Corey Shafer
1       janedoe@email.com      Jane Doe
2       johndoe@email.com      John Doe
3      ironman@avenge.com    Tony Stark
4          cap@avenge.com  Steve Rogers

In [79]:
# split full_name to first and last column
df['full_name'].str.split(' ', expand=True)

       0       1
0  Corey  Shafer
1   Jane     Doe
2   John     Doe
3   Tony   Stark
4  Steve  Rogers

In [80]:
df[['first','last']] = df['full_name'].str.split(' ', expand=True)

In [81]:
df

                    email     full_name  first    last
0  coreymshafer@gmail.com  Corey Shafer  Corey  Shafer
1       janedoe@email.com      Jane Doe   Jane     Doe
2       johndoe@email.com      John Doe   John     Doe
3      ironman@avenge.com    Tony Stark   Tony   Stark
4          cap@avenge.com  Steve Rogers  Steve  Rogers

## Adding rows

In [30]:
# adding single row of data
df.append({'first':'Tony'},ignore_index=True)

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@email.com
2   John     Doe       JohnDoe@email.com
3   Tony     NaN                     NaN

In [32]:
# adding a DataFrame to DataFrame

people = {'first': ['Tony','Steve'],
          'last' : ['Stark','Rogers'],
          'email' :['Ironman@avenge.com','Cap@avenge.com']}

df2 = pd.DataFrame(people)

In [33]:
df2

   first    last               email
0   Tony   Stark  Ironman@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [34]:
df.append(df2, ignore_index=True, sort=False)

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@email.com
2   John     Doe       JohnDoe@email.com
3   Tony   Stark      Ironman@avenge.com
4  Steve  Rogers          Cap@avenge.com

In [35]:
# append don't have inplace method so must do this
df = df.append(df2, ignore_index=True, sort=False)

In [36]:
# drop cap
df.drop(index=4)

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@email.com
2   John     Doe       JohnDoe@email.com
3   Tony   Stark      Ironman@avenge.com

In [38]:
# drop index with last == 'Doe'
filt = df['last']=='Doe'
df.drop(index=df[filt].index)

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
3   Tony   Stark      Ironman@avenge.com
4  Steve  Rogers          Cap@avenge.com

## Sorting

In [88]:
# Sort by last_name aplhabetically
df.sort_values(by='last', ascending=False)

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@email.com
2   John     Doe       JohnDoe@email.com

In [89]:
# if last name has duplicate val --> sort by first name
df.sort_values(by=['last','first'], ascending=False)

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
2   John     Doe       JohnDoe@email.com
1   Jane     Doe       JaneDoe@email.com

In [91]:
# sort mulitple cols 1 in ascending , 1 in descending
people = {'first': ['Corey','Jane','John','Adam'],
          'last' : ['Shafer','Doe','Doe','Doe'],
          'email' :['CoreyMShafer@gmail.com','JaneDoe@email.com','JohnDoe@email.com'
          ,'A@email.com']}

In [92]:
df = pd.DataFrame(people)

In [94]:
df.sort_values(by=['last','first'], ascending=[False,True], inplace=True)

In [95]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
3   Adam     Doe             A@email.com
1   Jane     Doe       JaneDoe@email.com
2   John     Doe       JohnDoe@email.com

In [96]:
# set it back by sorting index
df.sort_index()

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@email.com
2   John     Doe       JohnDoe@email.com
3   Adam     Doe             A@email.com

In [97]:
# sorting 1 col == sortinf Series
df['last'].sort_values()

3       Doe
1       Doe
2       Doe
0    Shafer
Name: last, dtype: object